Revit 2027 API
FabricationServiceSettings.RemoveFluidSetting Method
 Clears the fluid setting of the specified service if found.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveFluidSetting(
	FabricationService service
)
Public Sub RemoveFluidSetting (
	service As FabricationService
)
public:
void RemoveFluidSetting(
	FabricationService^ service
)
member RemoveFluidSetting :
        service : FabricationService -> unit
Parameters
service FabricationService
 The service to clear.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricationServiceSettings Class
Autodesk.Revit.DB Namespace